unmanned-supermarket-hardware/stm32F4Master/SYSTEM/usart/usart.h
#ifndef __USART_H
#define __USART_H
#include "stdio.h"	
#include "stm32f4xx_conf.h"
#include "sys.h" 
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//Mini STM32开发板
//串口1初始化		   
//正点原子@ALIENTEK
//技术论坛:www.openedv.csom
//修改日期:2011/6/14
//版本：V1.4
//版权所有，盗版必究。
//Copyright(C) 正点原子 2009-2019
//All rights reserved
//********************************************************************************
//V1.3修改说明 
//支持适应不同频率下的串口波特率设置.
//加入了对printf的支持
//增加了串口接收命令功能.
//修正了printf第一个字符丢失的bug
//V1.4修改说明
//1,修改串口初始化IO的bug
//2,修改了USART_RX_STA,使得串口最大接收字节数为2的14次方
//3,增加了USART_REC_LEN,用于定义串口最大允许接收的字节数(不大于2的14次方)
//4,修改了EN_USART1_RX的使能方式
////////////////////////////////////////////////////////////////////////////////// 	
#define USART_REC_LEN  			200  	//定义最大接收字节数 200
#define EN_USART1_RX 			1		//使能（1）/禁止（0）串口1接收
	  	
extern u8  USART_RX_BUF[USART_REC_LEN]; //接收缓冲,最大USART_REC_LEN个字节.末字节为换行符 
extern u16 USART_RX_STA;         		//接收状态标记	
//如果想串口中断接收，请不要注释以下宏定义
void uart1_init(u32 bound);




extern u8 UASRT2;



extern u16 USART2_RX_STA;   //接收数据状态
extern u8 USART2_jsonParseBuF[300]; 


extern unsigned char const crc8_tab[256];
unsigned	char crc8_calculate(unsigned char * ucPtr, unsigned char ucLen) ;


void uart2_init(u32 bound); //串口2初始化 
void usart2_send(u8 data);
void usart2_sendString(char *data,u8 len);





extern u8 USART3_jsonParseBuF[300];


void uart3_init(u32 bound); //串口3初始化 
void usart3_send(u8 data);
void usart3_sendString(char *data,u8 len);


//串口4
//TX:PC10   RX:PC11
void uart4_init(u32 bound); //串口4初始化 
void uart4_send(u8 data);
void uart4_sendString(char *data,u8 len);

//串口5
//RX: PD2  TX:  PC10
void uart5_init(u32 bound); //串口4初始化 
void uart5_send(u8 data);
void uart5_sendString(char *data,u8 len);



#endif


